import View.FootView;

public class Run {

//    Задание 3. Создайте класс Обувь. Необходимо хранить следую-щую информацию:
//    ■тип обуви:▶мужская,▶женская;
//    ■вид обуви (кроссовки, сапоги, сандалии, туфли и т.д.);
//    ■цвет;
//    ■цена;
//    ■производитель;
//    ■размер.
//    Создайте необходимые методы для этого класса.
//    Реа-лизуйте паттерн MVC для класса Обувь и код для
//    использования модели, контроллера и представления.

    public static void main(String[] args) throws InterruptedException {
        FootView view = new FootView();
    }
}
