package step;

import java.util.Random;
import java.util.Scanner;

public class Main {

    public static void main(String[] args) {
	 // Задание 2
        int i = 0xF;


        System.out.println(Integer.toHexString(i));
        /*
        Scanner sc = new Scanner(System.in);
        System.out.println("Задание 2");
        System.out.println("\nВведите число из 4-х чисел :");
        int v = sc.nextInt();
        int x,y,z,ost;
        x = (int) v/1000;
        ost = v%1000;
        y = (int) ost/100;
        ost = ost%100;
        z = (int) ost/10;
        ost = ost%10;
        System.out.printf("Число состоит из следующих цифр %d ; %d ; %d ; %d\n", x, y, z, ost);
        System.out.println("Произведение цифр введенного числа : " + x*y*z*ost);


     // Задание 1

        System.out.println("\nЗадание 1");
        System.out.println("\nВведите три цифры :");
        String a = sc.next();
        String b = sc.next();
        String c = sc.next();
        String t = a + b + c;
        System.out.println("В результате ввода сформировалось число : " + t);

    // Задание 3

	    System.out.println("\nЗадание 3");
        System.out.println("\nВведите колличество метров : ");
        float m = sc.nextFloat();
        System.out.println("Вы ввели число :" + m);
        System.out.printf("В см это будет равно : %.2f см\n", m*100);
        System.out.printf("В дм это будет равно : %.2f дм\n", m*10);
        System.out.printf("В мм это будет равно : %.2f мм\n",m*1000);


    // Задание 4
        System.out.println("\nЗадание 4");
        System.out.println("\nВведите размер основания треугольника :" );
        int l = sc.nextInt();
        System.out.println("Введите размер высоты треугольника :" );
        int h = sc.nextInt();
        float s = (float) 0.5*l*h;
        System.out.println("Площадь треугольника будет равнa : " + s);

    //Задание 5
        System.out.println("\nЗадание 5");
        System.out.println("\nВведите 4-хзначное число :");
        int u = sc.nextInt();
        int p, i, k, ost1;
        p = u/1000; ost1 = u%1000;
        i = ost1/100; ost1 = ost1%100;
        k = ost1/10; ost1 = ost1%10;
        ost1 = ost1*1000 + k*100 + i*10 + p;
        System.out.println("Вы ввели число : " + u + "  Зеркально оно будет иметь вид : " + ost1);


        sc.close();

         */
     }
    }
